Revit 2026 API

# SaveAsOptionsGetWorksharingOptions Method

---

Gets Worksharing options for SaveAs.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksharingSaveAsOptions GetWorksharingOptions()
```
```vb
Public Function GetWorksharingOptions As WorksharingSaveAsOptions
```
```cpp
public:
WorksharingSaveAsOptions^ GetWorksharingOptions()
```
```fsharp
member GetWorksharingOptions : unit -> WorksharingSaveAsOptions
```

#### Return Value

WorksharingSaveAsOptions Defaults to . For a workshared model, if  default values for WorksharingSaveAsOptions are used.

#### Reference

SaveAsOptions Class

Autodesk.Revit.DB Namespace